<a href="https://colab.research.google.com/github/HunterJordan/lambdata-DS29/blob/main/DS-UNIT-3-SPRINT-1SOFTWARE-ENGINEERING.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import FIBO as fi

In [4]:
from helper_functions import null_count, Ran

In [5]:
df2= pd.read_csv('/content/123submission (1).csv').head(100)

In [6]:
df2

       id    status_group
0   37098  non functional
1   14530      functional
2   62607      functional
3   46053      functional
4   47083      functional
..    ...             ...
95  60429  non functional
96  72254      functional
97  36141      functional
98  46569      functional
99  49550  non functional

[100 rows x 2 columns]

In [7]:
null_count(df2)

id              0
status_group    0
dtype: int64

In [8]:
fi.fib(10)

0 1 1 2 3 5 8

In [9]:
Ran(df2, 1)

       id    status_group
80  54487      functional
84  63454  non functional
33  49025      functional
81  64584      functional
93  47874      functional
..    ...             ...
75  39075      functional
9   71095  non functional
72   7116  non functional
12  73962  non functional
37  64337  non functional

[100 rows x 2 columns]